{
    "de":
    {
        "translation":
        {
        	"views": {
	        	"title": "Shahid | Lebenslauf",
	        	"available_for_hire": "Ich bin für Anstellung verfügbar!",
	            "nikname": "Shahid",
	            "profession": "Softwareingenieur",
	            "home": "Startseite",
	            "about": "Über uns",
	            "services": "Dienstleistungen",
	            "experience": "Erfahrung",
	            "hello": "Hallo!",
	            "name": "Ich bin Shahid Iqbal.",
	            "intro": "Als engagierter Fachmann bin ich stolz auf meine starke Arbeitsethik und mein ständiges Streben nach Verbesserung. Mit einem Track Record in puncto Pünktlichkeit und einer proaktiven Lernhaltung fördere ich ein positives, kollaboratives Arbeitsumfeld. Ich zeichne mich sowohl in der Eigenarbeit als auch im Team aus und blühe in schnelllebigen Umgebungen auf. Meine effektiven Kommunikations- und Problemlösungsfähigkeiten befähigen mich, aufmerksam zuzuhören und Herausforderungen taktvoll zu lösen, unterstützt von einem vielseitigen Hintergrund und einer Leidenschaft für das Lernen.",
	            "thankyou": "Vielen Dank für Ihre Zeit. Ich freue mich darauf, mit Ihnen in Kontakt zu treten.",
	            "view_works": "Arbeiten anzeigen",
	            "who_am_i": "Wer bin ich?",
	            "about_me": "Über mich",
	            "bio": "Biografie",
	            "bio_details": "Ich bin Shahid Iqbal, ein Softwareentwickler mit Leidenschaft für die Entwicklung robuster Webanwendungen. Mit über einem Jahrzehnt Erfahrung in Ruby on Rails habe ich an vielfältigen Projekten gearbeitet, die meine Fähigkeiten in der Backend-Entwicklung und Systemarchitektur geschärft haben. Neben Rails beherrsche ich PostgreSQL für die Datenbankverwaltung und verfüge über fundierte Kenntnisse in Frontend-Technologien wie HTML, CSS und jQuery. In letzter Zeit erkunde ich auch Python für seine Vielseitigkeit in Skripting und Automatisierungsaufgaben.",
	            "age": "Alter",
	            "residence": "Wohnsitz",
	            "japan": "Japan",
	            "email": "E-Mail",
	            "phone": "Telefon",
	            "download_cv": "Lebenslauf herunterladen",
	            "what_can_i_do": "Was kann ich tun?",
	            "my_skills": "Meine Fähigkeiten",
	            "gcp_desc": "Nutzen der Dienste von GCP zur Gestaltung skalierbarer und flexibler Cloud-Architekturen. Praktische Erfahrung im Bereich Cloud Computing.",
	            "front_end_development": "Front-End-Entwicklung (HTML/CSS/jQuery)",
	            "front_end_development_desc":"Ich habe mich auf HTML, CSS und jQuery spezialisiert und habe ein gutes Gespür für Benutzeroberflächendesign. Ich habe eine solide Grundlage in diesen Technologien.",
	            "python": "Python",
	            "ansible": "Ansible (Open-Source-IT-Automatisierungs-Engine)",
	            "ansible_desc": "Nutzen Sie die leistungsstarken Fähigkeiten von Ansible, um Infrastrukturmanagementprozesse zu optimieren und Aufgaben in verschiedenen Umgebungen zu automatisieren.",
	            "what_do_i_do": "Was soll ich tun?",
	            "backend_development": "Backend-Entwicklung",
	            "backend_development_desc": "Mit über einem Jahrzehnt Erfahrung in Ruby on Rails bin ich herausragend in der Entwicklung skalierbarer und effizienter serverseitiger Lösungen.",
	            "api_development": "API-Entwicklung",
	            "api_development_desc": "Ich verfüge über umfangreiche Erfahrung im Aufbau robuster APIs mit Ruby on Rails und FastAPI und habe solide Kenntnisse in beiden Frameworks.",
	            "education_experience": "Ausbildung und Erfahrung",
	            "resume": "Lebenslauf",
	            "resume_name": "Shahid Iqbal",
	            "tokyo": "Tokio",
	            "experienced_in_ruby_on_rails": "Erfahren in der Ruby on Rails Webentwicklung sowie im Projekt-Lebenszyklus-Management (Analyse, Design, Entwicklung, Teamleitung, Bereitstellung, Testing, Dokumentation, Wartung, technischer Support) mit Fachkenntnissen in MVC-Architektur, HTML5, Bootstrap, Restful API-Integration und Git/GitHub/Bitbucket. Zeige proaktive Problemlösungsfähigkeiten und Anpassungsfähigkeit.",
	            "work_experiences": "Berufserfahrung",
	            "senior_software_engineer": "Senior Softwareentwickler",
	            "software_engineer": "Softwareentwickler",
	            "contract_software_developer": "Vertragssoftwareentwickler",
	            "software_analyst": "Software-Analyst",
	            "protea": "PROTEA JAPAN | 2022 - Gegenwart",
	            "protea_desc": "Leitung der Feature-Entwicklung und Fehlerbehebungsmaßnahmen zur Sicherstellung einer robusten Anwendungs-funktionalität und optimalen Benutzererfahrung. Durchführung umfassender Code-Reviews und Verwaltung des Quellcodes mit Gitlab zur Sicherstellung hoher Standards und Förderung der Zusammenarbeit. Überwachung der Erstellung und Bereitstellung von Builds in mehreren Umgebungen sowie Implementierung von Automatisierung zur Steigerung der Effizienz. Enge Zusammenarbeit mit Designern zur Umsetzung intuitiver und barrierefreier Benutzeroberflächen. Einsatz vielfältiger technischer Fähigkeiten zur Lösung komplexer Probleme und Förderung von Innovationen. Bereitstellung von Mentoring, technischer Führung und Förderung einer kooperativen Teamumgebung zur Sicherstellung erfolgreicher Projektumsetzung und Abstimmung zwischen funktionsübergreifenden Teams.",
	            "vebuin": "VeBuIn | Dezember 2018 - Januar 2022",
	            "vebuin_desc": "Als Softwareentwickler bei VeBuIn Pvt. Ltd. habe ich Ruby on Rails eingesetzt, um hochwertige Softwarelösungen zu entwickeln und zu pflegen. Ich habe konsequent saubere Codierungsprinzipien eingehalten, um die Wartbarkeit und Skalierbarkeit des Codes sicherzustellen. Innerhalb eines Scrum-Teams habe ich zu iterativen und inkrementellen Verbesserungen beigetragen und effektiv mit funktionsübergreifenden Teams zusammengearbeitet, um robuste Funktionen zu liefern und komplexe Probleme zu lösen. Meine Rolle umfasste ein starkes Engagement für Best Practices in der Softwareentwicklung und kontinuierliche Verbesserung.",
	            "sodel_solutions": "Sodel Solutions | Juli 2018 - Dezember 2018",
	            "sodel_solutions_desc": "Bei Sodel Solutions Inc. war ich als Softwareentwickler spezialisiert auf Ruby on Rails tätig. Meine Aufgaben umfassten die Entwicklung und Wartung von APIs, die Integration von Active Admin zur effizienten Backend-Verwaltung sowie die Einhaltung von sauberen Codierungsprinzipien für wartbaren und skalierbaren Code. Innerhalb eines Scrum-Teams spielte ich eine Schlüsselrolle bei der Bereitstellung iterativer Verbesserungen und arbeitete eng mit funktionsübergreifenden Teams zusammen, um hochwertige Softwarelösungen zu gewährleisten.",
	            "unikaihatsu": "Unikaihatsu Software | November 2016 - Juli 2018",
	            "unikaihatsu_desc": "Bei Unikaihatsu Software Pvt. Ltd. war ich als Softwareentwickler tätig und nutzte Ruby on Rails und PostgreSQL, um robuste und skalierbare Anwendungen zu entwickeln. Mit Bootstrap habe ich responsive und optisch ansprechende Benutzeroberflächen erstellt. Mein Engagement für saubere Codierungspraktiken gewährleistete hochwertigen Code, und meine Erfahrung in Scrum ermöglichte effektive Zusammenarbeit innerhalb agiler Teams. Durch die Integration dieser Technologien und Methoden trug ich zur Bereitstellung hochwertiger Softwarelösungen bei.",
	            "excel_infoways": "Excel Infoways Ltd | März 2016 - November 2016",
	            "excel_infoways_desc": "Als Softwareentwickler bei Excel Infoways Ltd habe ich mich auf Ruby on Rails Entwicklung spezialisiert und dabei stark auf die Entwicklung skalierbarer APIs für E-Commerce Plattformen fokussiert. Ich habe konsequent saubere Codierungspraktiken angewendet, um wartbare und effiziente Codebasen zu gewährleisten. Meine Aufgabe umfasste die enge Zusammenarbeit mit funktionsübergreifenden Teams, um maßgeschneiderte Softwarelösungen zu liefern, die den einzigartigen Anforderungen von E-Commerce Unternehmen gerecht werden. Meine Expertise in API Entwicklung und E-Commerce Lösungen hat maßgeblich zur Verbesserung der technologischen Fähigkeiten des Unternehmens und zur effektiven Erreichung der Geschäftsziele beigetragen.",
	            "cerebrate": "Cerebrate, Inc | November 2015 - März 2016",
	            "cerebrate_desc": "Bei Cerebrate, Inc. begann ich als Rails-Entwickler und wechselte schnell zur Arbeit mit dem MEAN-Stack (MongoDB, Express.js, Angular.js, Node.js). Dieser Wechsel war entscheidend für die Erweiterung meiner Fähigkeiten und den Umgang mit modernsten Technologien. Ich habe in der Kultur der Innovation und Zusammenarbeit bei Cerebrate erfolgreich gearbeitet, wo ich befähigt wurde, neue Ideen umzusetzen. Diese dynamische Umgebung fordert mich ständig heraus, mich selbst zu neuen Höchstleistungen anzuspornen.",
	            "botree": "BoTree Technologies Pvt. Ltd. | Februar 2015 - Oktober 2015",
	            "botree_desc": "In meiner Rolle bei BoTree Technologies Pvt Ltd war ich dafür verantwortlich, neue Module unter Verwendung von Ruby on Rails hinzuzufügen. Diese Erfahrung hat mir nicht nur geholfen, meine technischen Fähigkeiten zu schärfen, sondern auch die Bedeutung von Teamarbeit und effizientem Projektmanagement kennengelernt. Ich bin der Überzeugung, dass Zusammenarbeit und effektive Kommunikation entscheidend für die erfolgreiche Durchführung von Projekten sind.",
	            "sharingdais": "Sharingdais | September 2014 - Dezember 2014",
	            "sharingdais_desc": "Sharingdais.com war ein Startup-Unternehmen mit einem produktbasierten Ansatz. Ich trat als Softwareentwickler in dieses Unternehmen ein und war dafür verantwortlich, neue Funktionen hinzuzufügen und Fehler zu beheben. Die Website wurde mit Rails und Bootstrap entwickelt.",
	            "dreamsoft4u": "DreamSoft4u Pvt. Ltd. | Juli 2014 - September 2014",
	            "dreamsoft4u_desc": "Während mein vorheriger Job hauptsächlich auf jQuery und Plugin-Integration ausgerichtet war, wollte ich mich herausfordern und sehen, wie ich mich selbstständig bei der Entwicklung eines Features mit Ruby on Rails schlagen würde. Deshalb habe ich mich entschieden, einen Vertragsjob bei DreamSoft4u Pvt. Ltd. anzunehmen. Während meiner Zeit bei DreamSoft4u Pvt. Ltd. hatte ich die Möglichkeit, an Projekten wie Shopify und einer kleinen Chat-Anwendung zu arbeiten. Diese Erfahrungen haben nicht nur meine technischen Fähigkeiten geschärft, sondern mir auch die Bedeutung von Anpassungsfähigkeit und Problemlösung vermittelt.",
	            "kartik_solutions": "Kartik Solutions Pvt. Ltd. | Juni 2013 - Juni 2014",
	            "kartik_solutions_desc": "Mein Interesse an Ruby on Rails begann, als ich bei meinem vorherigen Unternehmen arbeitete, das auch dieses Framework für ihr Backend nutzte. Ich war fasziniert von seinen Möglichkeiten und wusste, dass ich mehr lernen wollte. Also habe ich die Initiative ergriffen, um Ruby zu lernen, und nur 3 Monate später konnte ich meine erste Gelegenheit als Backend-Entwickler sichern. Bei Kartik Solutions Pvt. Ltd. bin ich für die Pflege und Verbesserung unserer bestehenden Website verantwortlich. Dies hat mir die Möglichkeit gegeben, mit verschiedenen Plugins und Tools zu arbeiten, einschließlich der Integration von Fitbit für unsere Nutzer. Es war eine herausfordernde, aber auch belohnende Erfahrung, da ich kontinuierlich als Entwickler lernen und wachsen konnte.",
	            "beryl_systems": "Beryl Systems | Dezember 2012 - Mai 2013",
	            "beryl_systems_desc": "Meine Karriere begann bei Beryl Systems, wo ich die Möglichkeit hatte, mit dem Bootstrap-Framework zu arbeiten und meine Fähigkeiten in jQuery und Bootstrap zu verbessern. Während meiner Zeit bei Beryl Systems war ich verantwortlich für die Erstellung neuer Seiten und die Verbesserung des Designs bestehender Seiten. Dies ermöglichte es mir, nicht nur meine Kreativität zu zeigen, sondern auch die Gesamtnutzererfahrung für unsere Kunden zu verbessern.",
	            "projects": "Projekte",
	            "right_on": "RightOn",
	            "right_on_desc": "Dies ist eine E-Commerce-Website, die sich auf den Verkauf von Bekleidung spezialisiert hat. Ihre Produkte sind auch auf anderen E-Commerce-Plattformen wie Rakuten, &mall, Magaseek, PayPay usw. aufgeführt. Das System ist darauf ausgelegt, Bestellungen von diesen Plattformen zu verfolgen, sie an das Lager zu senden, den Versand der Bestellungen zu verwalten und die Lagerbestände zu führen.",
	            "right_on_hr": "RightOn (Personalwirtschaftssystem)",
	            "confidential": "Vertraulich",
	            "right_on_hr_desc": "Dieses System wurde als Datenlösung für die Personalabteilung eines Unternehmens konzipiert. Es fungiert als Workflow-System, über das Mitarbeiter Urlaubsanträge, Spesen und andere Anfragen stellen können. Anfragen werden zunächst an Manager zur Genehmigung weitergeleitet und dann zur endgültigen Genehmigung an die Personalabteilung. Das System ermöglicht es Managern und HR-Personal, die Workflow-Schritte nach Bedarf anzupassen, z. B. die Genehmigungshierarchie zu erhöhen oder zu verringern.",
	            "giftcardspread": "Giftcardspread",
	            "giftcardspread_desc": "Dieses System war ursprünglich ein Subsystem von Giftcardspread. Seine Hauptfunktion besteht darin, Produktpreise durch den Vergleich mit Preisen anderer Systeme zu verwalten.",
	            "whiskk": "Whiskk",
	            "na": "Nicht verfügbar",
	            "whiskk_desc": "Es handelte sich um eine soziale App, die darauf abzielte, soziale Interaktion und Unterstützung innerhalb einer Gemeinschaft zu erleichtern. Die App sollte die vielfältigen Bedürfnisse der Menschen in derselben Gesellschaft befriedigen, indem sie gegenseitige Unterstützung und Verbindungen fördert.",
	            "advowire": "Advowire",
	            "advowire_desc": "AdvoWire erleichtert die Verbindungen zwischen Bloggern, Social-Media-Nutzern, Marken und Agenturen für Influencer- und Word-of-Mouth-Marketingkampagnen. Benutzer erstellen „Advocate“-Profile und erhalten Anreize für die Teilnahme an relevanten Kampagnen. Die Berechtigung wird durch die Branchenzugehörigkeit, die Reichweite des Netzwerks und den geografischen Standort bestimmt. Die Authentizität der Advocate-Netzwerke wird durch integrierte Verifizierungsmethoden sichergestellt, um gefälschte oder inaktive Kontakte und Follower zu reduzieren und so die Effektivität und Glaubwürdigkeit der Kampagnen zu steigern.",
	            "sharingdais_project": "Sharingdais",
	            "sharingdais_project_desc": "Diese Plattform dient als Online-Listing-Service für Peer-to-Peer (P2P)-Aktivitäten wie das Teilen von Lebensmitteln, Fähigkeiten und Büchern. Nutzer können auf der Plattform diese Dienste anbieten und entdecken, Interesse an Einträgen bekunden und sich zum Zwecke des Teilens mit anderen Nutzern verbinden. Die Plattform ist derzeit für Nutzer in den Regionen Bangalore und NCR (National Capital Region) verfügbar.",
	            "tmo": "TMO(TomrMenOutfit)",
	            "tmo_desc": "Es handelte sich um ein Chat-System, das speziell für die Kommunikation zwischen Schneidern und Kunden entwickelt wurde.",
	            "sharemeister": "Sharemeister",
	            "sharemeister_desc": "Sharemeister ist ein Software-Dienstprogramm, das einen Marktplatz für Ressourcen bietet, der darauf ausgelegt ist, jede digitale Anwendung zu skalieren.",
	            "pinni_insurance": "Pinni Versicherung",
	            "pinni_insurance_desc": "Dieses Projekt war das erste, an dem ich gearbeitet habe. Es umfasste das Design eines Systems zur Verwaltung von Daten speziell für ein Versicherungsunternehmen.",
	            "skills": "Fähigkeiten",
	            "technical": "Technisch",
	            "shopify": "Shopify",
	            "ruby_on_rails": "Ruby on Rails",
	            "fast_api": "FastAPI",
	            "kong_gateway": "Kong API Gateway",
	            "postgresql": "PostgreSQL",
	            "html": "HTML",
	            "css": "CSS",
	            "jquery": "Jquery",
	            "bootstrap": "Bootstrap",
	            "reactjs": "ReactJS",
	            "mean_stack": "MEAN Stack",
	            "gcp": "Google Cloud Platform (GCP)",
	            "aws": "AWS (Amazon Web Services)",
	            "ansible": "Ansible",
	            "docker": "Docker",
	            "clean_coding": "Sauberes Codieren",
	            "code_review": "Code-Überprüfung",
	            "scrum": "Scrum",
	            "gitlab": "GitLab",
	            "gitHub": "GitHub",
	            "bitbucket": "Bitbucket",
	            "redis": "Redis",
	            "javascript_react": "JavaScript/React",
	            "ruby_python": "Ruby/Python",
	            "postgre_mysql": "PostgreSQL/MySQL",
	            "object_oriented_design": "Objektorientiertes Design",
	            "design_and_implement_database_structures": "Entwurf und Implementierung von Datenbankstrukturen",
	            "lead_and_deliver_complex_software_systems": "Führen und Liefern komplexer Softwaresysteme",
	            "professional": "Professionell",
	            "effective_communication": "Effektive Kommunikation",
	            "team_player": "Teamplayer",
	            "strong_problem_solver": "Starker Problemlöser",
	            "good_time_management": "Gutes Zeitmanagement",
	            "education": "Bildung",
	            "bachelor_of_technology": "Bachelor of Technology in Informatik",
	            "university": "Universität Veer Bahadur Singh Purvanchal, Jaunpur",
	            "languages": "Sprachen",
	            "hindi": "Hindi",
	            "english": "English",
	            "japanese": "Japanese",
	            "german": "Deutschland",
	            "urdu": "Urdu",
	            "native": "(Native)",
	            "conversational": "(conversational)",
	            "interests": "Interests",
	            "cooking": "Cooking"
            }
        }
    }
}