{
    "us":
    {
        "translation":
        {
        	"views": {
        		"title": "Shahid | Resume",
                "available_for_hire": "I'm available for hire!",
            	"nikname": "Shahid",
                "profession": "Software Engineer",
                "home": "Home",
                "about": "About",
                "services": "Services",
                "experience": "Experience",
                "hello": "Hello!",
                "name": "I'm Shahid Iqbal.",
                "intro": "As a dedicated professional, I am proud of my strong work ethic and constant pursuit of improvement. With a track record of punctuality and a proactive approach to learning, I foster a positive, collaborative work environment. I excel independently and as part of a team, thriving in fast-paced settings. My effective communication and problem-solving skills make me adept at listening and tactfully resolving challenges with a diverse background and passion for learning.",
                "thankyou": "Thank you for your time. I look forward to connecting with you.",
                "view_works": "View Works",
                "who_am_i": "Who am I?",
                "about_me": "About Me",
                "bio": "Bio",
                "bio_details": "I'm Shahid Iqbal, a Software Engineer with a passion for building robust web applications. With over a decade of experience in Ruby on Rails, I've had the opportunity to work on diverse projects that have honed my skills in backend development and system architecture. Alongside Rails, I'm proficient in PostgreSQL for database management, and I have a strong grasp of front-end technologies like HTML, CSS, and jQuery. Recently, I've also been exploring Python for its versatility in scripting and automation tasks.",
                "age": "Age",
                "residence": "Residence",
                "japan": "Japan",
                "email": "Email",
                "phone": "Phone",
                "download_cv": "Download CV",
                "what_can_i_do": "What can I do?",
                "my_skills": "My Skills",
                "gcp_desc": "Leveraging GCP's suite of services to design scalable and flexible cloud architectures. With hands-on experience in cloud computing.",
                "front_end_development": "Front-end Development(HTML/CSS/Jquery)",
                "front_end_development_desc":"I specialize in HTML, CSS, and jQuery and have a keen eye for user interface design. I have a solid foundation in these technologies.",
                "python": "Python",
                "ansible": "Ansible(Open source IT automation engine)",
                "ansible_desc": "Leverage Ansible's powerful capabilities to streamline infrastructure management processes and automate tasks across diverse environments.",
                "what_do_i_do": "What do I do?",
                "backend_development": "Backend Development",
                "backend_development_desc": "With over a decade of experience in Ruby on Rails, I excel at building scalable and efficient server-side solutions.",
                "api_development": "API Development",
                "api_development_desc": "I bring extensive experience in building robust APIs using Ruby on Rails and FastAPI, with a strong foundation in both frameworks.",
                "education_experience": "Education & Experience",
                "resume": "Resume",
                "resume_name": "Shahid Iqbal",
                "tokyo": "Tokyo",
                "experienced_in_ruby_on_rails": "Experienced in Ruby on Rails web development, project life cycle management (Analysis, Design, Development, Team Leadership, Deployment, Testing, Documentation, Maintenance, Technical Support), with expertise in MVC architecture, HTML5, Bootstrap, Restful API integration, and Git/GitHub/Bitbucket, demonstrating proactive problem-solving and adaptability.",
                "work_experiences": "Work Experiences",
                "senior_software_engineer": "Senior Software Engineer",
                "software_engineer": "Software Engineer",
                "contract_software_developer": "Contract Software Developer",
                "software_analyst": "Software Analyst",
                "protea": "PROTEA JAPAN | 2022 - Present",
                "protea_desc": "Lead feature development and bug fixing efforts, ensuring robust application functionality and optimal user experience. Conduct comprehensive code reviews and manage source code using Gitlab, enforcing high standards and fostering collaboration. Oversee build creation and deployment across multiple environments, implementing automation for efficiency. Collaborate closely with designers to implement intuitive and accessible user interfaces. Leverage diverse technical skills to solve complex problems and drive innovation. Provide mentorship, technical leadership, and promote a collaborative team environment, ensuring successful project delivery and alignment across cross-functional teams.",
                "vebuin": "VeBuIn | 12 2018 - 01 2022",
                "vebuin_desc": "As a Software Engineer at VeBuIn Pvt. Ltd., I utilized Ruby on Rails to develop and maintain high-quality software solutions. I consistently adhered to clean coding principles to ensure code maintainability and scalability. Working within a Scrum team, I contributed to iterative and incremental improvements, effectively collaborating with cross-functional teams to deliver robust features and resolve complex issues. My role involved a strong commitment to software engineering best practices and continuous improvement.",
                "sodel_solutions": "Sodel Solutions | 07 2018 - 12 2018",
                "sodel_solutions_desc": "At Sodel Solutions Inc., I served as a Software Engineer specializing in Ruby on Rails. My role involved developing and maintaining APIs, integrating Active Admin for efficient backend management, and adhering to clean coding principles for maintainable and scalable code. Working within a Scrum team, I played a key role in delivering iterative improvements and collaborating with cross-functional teams to ensure high-quality software solutions.",
                "unikaihatsu": "Unikaihatsu Software | 11 2016 - 07 2018",
                "unikaihatsu_desc": "At Unikaihatsu Software Pvt. Ltd., I worked as a Software Engineer, leveraging Ruby on Rails and PostgreSQL to develop robust and scalable applications. I utilized Bootstrap to create responsive and visually appealing user interfaces. My commitment to clean coding practices ensured high-quality code, and my experience in Scrum facilitated effective collaboration within agile teams. I contributed to delivering high-quality software solutions by integrating these technologies and methodologies.",
                "excel_infoways": "Excel Infoways Ltd | 03 2016 - 11 2016",
                "excel_infoways_desc": "As a Software Engineer at Excel Infoways Ltd, I specialized in Ruby on Rails development with a strong emphasis on building scalable APIs for e-commerce platforms. I consistently applied clean coding practices to ensure maintainable and efficient codebases. My role involved collaborating closely with cross-functional teams to deliver tailored software solutions that met the unique demands of e-commerce businesses. My expertise in API development and e-commerce solutions contributed significantly to enhancing the company's technological capabilities and achieving business objectives effectively.",
                "cerebrate": "Cerebrate, Inc | 11 2015 - 03 2016",
                "cerebrate_desc": "At Cerebrate, Inc., I began as a Rails developer and quickly transitioned to working with the MEAN stack (MongoDB, Express.js, Angular.js, Node.js). This shift was pivotal in expanding my skills and working with cutting-edge technologies.I've thrived in Cerebrate's culture of innovation and collaboration, where I've been empowered to bring new ideas to fruition. This dynamic environment constantly challenges me to push myself to new heights.",
                "botree": "BoTree Technologies Pvt. Ltd. | 02 2015 - 10 2015",
                "botree_desc": "In my role at BoTree Technologies Pvt Ltd, I was responsible for adding new modules using Ruby on Rails. This experience not only allowed me to sharpen my technical abilities, but also taught me the importance of teamwork and efficient project management. I believe that collaboration and effective communication are key to delivering successful projects.",
                "sharingdais": "Sharingdais | 09 2014 - 12 2014",
                "sharingdais_desc": "Sharingdais.com was a startup product-based company.I joined this company as a software engineer and my responsibility was to add new features and solve bugs. This site was built on Rails and Bootstrap.",
                "dreamsoft4u": "DreamSoft4u Pvt. Ltd. | 07 2014 - 09 2014",
                "dreamsoft4u_desc": "While my previous job focused mostly on JQuery and plugin integration, I wanted to challenge myself and see how I would fare working independently on a feature using Ruby on Rails. That's why I decided to take on a contract job at DreamSoft4u Pvt. Ltd. During my time at DreamSoft4u Pvt. Ltd, I had the opportunity to work on projects such as Shopify and a small chat application. These experiences have not only honed my technical skills but also taught me the importance of adaptability and problem-solving.",
                "kartik_solutions": "Kartik Solutions Pvt. Ltd. | 06 2013 - 06 2014",
                "kartik_solutions_desc": "My interest in Ruby on Rails began when I was working at my previous company, which also used the framework for their backend. I was fascinated by its capabilities and knew I wanted to learn more. So, I took the initiative to dive into learning Ruby and after just 3 months, I was able to secure my first opportunity as a backend developer.At Kartik Solutions Pvt. Ltd, I have been responsible for maintaining and enhancing our existing site. This has given me the opportunity to work with different plugins and tools, including integrating Fitbit for our users. It has been a challenging yet rewarding experience, as I have been able to continuously learn and grow as a developer.",
                "beryl_systems": "Beryl systems | 12 2012 - 05 2013",
                "beryl_systems_desc": "I began my career at Beryl systems, where I had the opportunity to work with the Bootstrap framework and hone my skills in jQuery and Bootstrap. During my time at Beryl systems, I was responsible for creating new pages and enhancing the design of existing pages. This allowed me to not only showcase my creativity but also improve the overall user experience for our clients.",
                "projects": "Projects",
                "right_on": "RightOn",
                "right_on_desc": "This is an e-commerce website specializing in garment sales. Its products are also listed on other e-commerce platforms such as Rakuten, &mall, Magaseek, PayPay, etc. The system is designed to track orders from these platforms, send them to the warehouse, manage order shipments, and maintain inventory records.",
                "right_on_hr": "RightOn(HR system)",
                "confidential": "Confidential",
                "right_on_hr_desc": "This system is designed as a data storage solution for the HR department of a company. It operates as a workflow system where employees can apply for leaves, expenses, and other requests. Requests are initially forwarded to managers for approval and then to HR for final approval. The system allows managers and HR personnel to adjust the workflow steps as needed, such as increasing or decreasing the approval hierarchy.",
                "giftcardspread": "Giftcardspread",
                "giftcardspread_desc": "This system was originally a subsystem of Giftcardspread. Its primary function is to manage product prices by comparing them with prices from other systems.",
                "whiskk": "Whiskk",
                "na": "NA",
                "whiskk_desc": "It was a social app designed to facilitate social interaction and support within a community. The app aimed to meet the diverse needs of individuals living in the same society by fostering mutual assistance and connections.",
                "advowire": "Advowire",
                "advowire_desc": "AdvoWire facilitates connections between bloggers, social media users, brands, and agencies for influencer and word-of-mouth marketing campaigns. Users create 'Advocate' profiles and receive incentives for participating in relevant campaigns. Eligibility is determined by industry alignment, network reach, and geographic location. The authenticity of Advocate networks is ensured through integrated verification methods to mitigate fake or inactive contacts and followers, enhancing campaign effectiveness and credibility.",
                "sharingdais": "Sharingdais",
                "sharingdais_desc": "This platform serves as an online listing service for peer-to-peer (P2P) activities such as sharing food, skills, and books. Users can both offer and discover these services on the platform, express interest in listings, and connect with other users for sharing purposes. The platform is currently available for users in the Bangalore and NCR (National Capital Region) regions.",
                "tmo": "TMO(TomrMenOutfit)",
                "tmo_desc": "It was a chat system designed specifically for communication between tailors and customers.",
                "sharemeister": "Sharemeister",
                "sharingdais_desc": "Sharemeister is a software utility service that offers a marketplace of resources designed to scale any digital application.",
                "pinni_insurance": "Pinni insurance",
                "pinni_insurance_desc": "This project was the first one I worked on. It involved designing a system to manage data specifically for an insurance company.",
                "skills": "Skills",
                "technical": "Technical",
                "shopify": "Shopify",
                "ruby_on_rails": "Ruby on Rails",
                "fast_api": "FastAPI",
                "kong_gateway": "Kong API Gateway",
                "postgresql": "PostgreSQL",
                "html": "HTML",
                "css": "CSS",
                "jquery": "Jquery",
                "bootstrap": "Bootstrap",
                "reactjs": "ReactJS",
                "mean_stack": "MEAN Stack",
                "gcp": "Google Cloud Platform (GCP)",
                "aws": "AWS (Amazon Web Services)",
                "ansible": "Ansible",
                "docker": "Docker",
                "clean_coding": "Clean Coding",
                "code_review": "Code Review",
                "scrum": "Scrum",
                "gitlab": "GitLab",
                "gitHub": "GitHub",
                "bitbucket": "Bitbucket",
                "redis": "Redis",
                "javascript_react": "JavaScript/React",
                "ruby_python": "Ruby/Python",
                "postgre_mysql": "PostgreSQL/MySQL",
                "object_oriented_design": "Object-oriented design",
                "design_and_implement_database_structures": "Design and implement database structures",
                "lead_and_deliver_complex_software_systems": "Lead and deliver complex software systems",
                "professional": "Professional",
                "effective_communication": "Effective communication",
                "team_player": "Team player",
                "strong_problem_solver": "Strong problem solver",
                "good_time_management": "Good time management",
                "education": "Education",
                "bachelor_of_technology": "Bachelor of Technology in Computer Science",
                "university": "University: Veer Bahadur Singh Purvanchal University, Jaunpur",
                "languages": "Languages",
                "hindi": "Hindi",
                "english": "English",
                "japanese": "日本語",
                "german": "Deutschland",
                "urdu": "Urdu",
                "native": "(Native)",
                "conversational": "(conversational)",
                "interests": "Interests",
                "cooking": "Cooking"
            }
        }
    }
}